Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиОтпусковСотрудников.Очистить();
	Движения.ОстаткиОтпусковСотрудников.Записывать = Истина;
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.ДатаНачала = '00010101' 
			ИЛИ Строка.ДатаКонца = '00010101' Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.ДатаКонца < Строка.ДатаНачала Тогда
			Продолжить;
		КонецЕсли;
		
		РазницаВСекундах = Строка.ДатаКонца - Строка.ДатаНачала;
		КоличествоДней = РазницаВСекундах / 86400 + 1;
		Если КоличествоДней <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ОстаткиОтпусковСотрудников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Строка.ДатаНачала;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.КоличествоДней = КоличествоДней;
		
	КонецЦикла;
	
КонецПроцедуры