Процедура ОбработкаПроведения(Отказ, Режим)
	
	НачПериода = НачалоМесяца(Дата);
	КонПериода = КонецМесяца(Дата);
	
	ВидПремия = ПланыВидовРасчета.ДополнительныеНачисления.НайтиПоКоду("ПРЕМ");
	ВидНДФЛ = ПланыВидовРасчета.Удержания.НайтиПоКоду("НЛГ");
	
	Если ВидПремия = Неопределено Тогда
		Отказ = Истина;
		Сообщить("Вид расчета 'ФиксированнаяПремия' не найден");
		Возврат;
	КонецЕсли;
	
	Если ВидНДФЛ = Неопределено Тогда
		Отказ = Истина;
		Сообщить("Вид расчета 'НДФЛ' не найден");
		Возврат;
	КонецЕсли;
	
	Движения.ДополнительныеНачисления.Записывать = Истина;
	Движения.Удержания.Записывать = Истина;
	Движения.ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Для Каждого Строка Из СписокСотрудников Цикл
		
		Сотрудник = Строка.Сотрудник;
		СуммаПремии = Строка.СуммаПремии;
		
		НДФЛ = Окр(СуммаПремии * 13 / 100, 2);
		КВыплате = СуммаПремии - НДФЛ;
		
		Если СуммаПремии > 0 Тогда
			Движение = Движения.ДополнительныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ПериодРегистрации = Дата;
			Движение.ПериодДействияНачало = НачПериода;
			Движение.ПериодДействияКонец = КонПериода;
			Движение.Сотрудник = Сотрудник;
			Движение.Сумма = СуммаПремии;
			Движение.ВидРасчета = ВидПремия;
		КонецЕсли;
		
		Если НДФЛ > 0 Тогда
			ДвижениеУдерж = Движения.Удержания.Добавить();
			ДвижениеУдерж.Сторно = Ложь;
			ДвижениеУдерж.ПериодРегистрации = Дата;
			ДвижениеУдерж.ПериодДействияНачало = НачПериода;
			ДвижениеУдерж.ПериодДействияКонец = КонПериода;
			ДвижениеУдерж.Сотрудник = Сотрудник;
			ДвижениеУдерж.Сумма = НДФЛ;
			ДвижениеУдерж.ВидРасчета = ВидНДФЛ;
		КонецЕсли;
		
		Если КВыплате <> 0 Тогда
			ДвижениеВР = Движения.ВзаиморасчетыССотрудниками.Добавить();
			ДвижениеВР.ВидДвижения = ВидДвиженияНакопления.Приход;
			ДвижениеВР.Период = Дата;
			ДвижениеВР.Сотрудник = Сотрудник;
			ДвижениеВР.Сумма = КВыплате;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры