//ВКМ Начало изменений: Проверка по виду договора, датам и заполнение движений
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроцентОтРабот = 0;
	
	Если ВКМ_Договор.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда  
		Отказ = Истина;
		Сообщить("Данный договор не является абонентским обслуживанием");
		Возврат;
	КонецЕсли;
	
	Если Дата < ВКМ_Договор.ВКМ_АбонДатаНачала ИЛИ Дата > ВКМ_Договор.ВКМ_АбонДатаОкончания Тогда
		Сообщить("Дата документа выходит за пределы действия договора");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВКМ_Специалист) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УсловияОплатыСотрудников.ПроцентОтРабот КАК ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.УсловияОплатыСотрудников КАК УсловияОплатыСотрудников
		|ГДЕ
		|	УсловияОплатыСотрудников.Сотрудник = &Сотрудник
		|	И УсловияОплатыСотрудников.Период <= &ДатаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	УсловияОплатыСотрудников.Период УБЫВ";
		
		Запрос.УстановитьПараметр("Сотрудник", ВКМ_Специалист);
		Запрос.УстановитьПараметр("ДатаДокумента", НачалоМесяца(Дата));
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			ПроцентОтРабот = Выборка.ПроцентОтРабот;
		Иначе
			Отказ = Истина;      
			Сообщить(СтрШаблон("Для специалиста %1 не установлен процент оплаты от работ на дату %2",ВКМ_Специалист,Формат(Дата, "ДФ=dd.MM.yyyy")));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВсегоЧасов = 0;
	ВсегоСумма = 0;
	
	Для Каждого Строка Из ВКМ_ВыполненныеРаботы Цикл
		ВсегоЧасов = ВсегоЧасов + Строка.ВКМ_ЧасыКОплате;
		ВсегоСумма = ВсегоСумма + (Строка.ВКМ_ЧасыКОплате * ВКМ_Договор.ВКМ_АбонСтоимостьЧаса);
	КонецЦикла;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.ВКМ_Клиент = ВКМ_Клиент;
	Движение.ВКМ_Договор = ВКМ_Договор;
	Движение.ВКМ_КоличествоЧасов = ВсегоЧасов;
	Движение.ВКМ_СуммаКОплате = ВсегоСумма; 
	Движение.ВКМ_Специалист = ВКМ_Специалист;
	

КонецПроцедуры
//ВКМ Конец изменений