Процедура ЗаполнитьДоговоры() Экспорт
	
	Если ЗначениеЗаполнено(Период) = Ложь Тогда
		ВызватьИсключение "Укажите период для формирования актов";
	КонецЕсли;
	
	НачПериода = НачалоМесяца(Период);
	КонПериода = КонецМесяца(Период);
	
	Договоры.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договоры.Ссылка КАК Договор,
	|	Договоры.Владелец КАК Контрагент,
	|	Договоры.Организация КАК Организация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК Договоры
	|ГДЕ
	|	Договоры.ВидДоговора = &ВидДоговора
	|	И Договоры.ВКМ_АбонСуммаАбонПлаты <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Договоры.Владелец,
	|	Договоры.Ссылка";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("НачПериода", НачПериода);
	Запрос.УстановитьПараметр("КонПериода", КонПериода);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаДоговор = Договоры.Добавить();
		СтрокаДоговор.Договор = Выборка.Договор;
		СтрокаДоговор.Организация = Выборка.Организация;
		СтрокаДоговор.Контрагент = Выборка.Контрагент;
		СтрокаДоговор.Создан = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

