&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Выплаты.Очистить();
	ДатаДокумента = КонецМесяца(Объект.Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник,
	|	СУММА(ВзаиморасчетыССотрудниками.Сумма) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|ГДЕ
	|	ВзаиморасчетыССотрудниками.Период <= &ДатаДокумента
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыССотрудниками.Сотрудник
	|ИМЕЮЩИЕ
	|	СУММА(ВзаиморасчетыССотрудниками.Сумма) > 0";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Строка = Объект.Выплаты.Добавить();
		Строка.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Строка.Сумма = ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
	
КонецПроцедуры      

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Проведен Тогда
		Элементы.Заполнить.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры