//ВКМ_Начало изменений. Управление видимостью объекта, в зависимости от вида договора

#Область ОбработчикСобытийФормы
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		Элементы.ВКМ_АбонОбслуживание.Видимость = Истина
	
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ВКМ_АбонОбслуживание.Видимость = Ложь

КонецПроцедуры
//ВКМ_Конец изменений.
#КонецОбласти 


